# 第3章 データの概要を確認しよう

In [1]:
import pandas as pd
import numpy as np

---

## 3.1 列ごとの統計量を確認するには

In [2]:
df = pd.DataFrame(
    [
        ["Alice", "国語", 87],
        ["Alice", "数学", np.nan],
        ["Bob", "国語", 65],
        ["Bob", "数学", 92],
    ],
    columns=["Name", "Subject", "Point"],
)
display(df)

    Name Subject  Point
0  Alice      国語   87.0
1  Alice      数学    NaN
2    Bob      国語   65.0
3    Bob      数学   92.0

### やってみよう

In [5]:
df.describe()

           Point
count   3.000000
mean   81.333333
std    14.364308
min    65.000000
25%    76.000000
50%    87.000000
75%    89.500000
max    92.000000

In [6]:
df.describe(include="all")

         Name Subject      Point
count       4       4   3.000000
unique      2       2        NaN
top     Alice      国語        NaN
freq        2       2        NaN
mean      NaN     NaN  81.333333
std       NaN     NaN  14.364308
min       NaN     NaN  65.000000
25%       NaN     NaN  76.000000
50%       NaN     NaN  87.000000
75%       NaN     NaN  89.500000
max       NaN     NaN  92.000000

---

## 3.2 最小と最大を抽出するには

In [7]:
df = pd.DataFrame(
    [
        ["Alice", "国語", 87],
        ["Alice", "数学", np.nan],
        ["Bob", "国語", 65],
        ["Bob", "数学", 92],
    ],
    columns=["Name", "Subject", "Point"],
)
df

    Name Subject  Point
0  Alice      国語   87.0
1  Alice      数学    NaN
2    Bob      国語   65.0
3    Bob      数学   92.0

### やってみよう

In [16]:
df[(df["Point"] == max(df["Point"])) | (df["Point"] == min(df["Point"]))]

  Name Subject  Point
2  Bob      国語   65.0
3  Bob      数学   92.0

In [17]:
df[(df["Point"] == df["Point"].max()) | (df["Point"] == df["Point"].min())]

  Name Subject  Point
2  Bob      国語   65.0
3  Bob      数学   92.0

In [19]:
(df["Point"] == df["Point"].max()) | (df["Point"] == df["Point"].min())

0    False
1    False
2     True
3     True
Name: Point, dtype: bool

In [20]:
df["Point"].isin({df["Point"].min(),df["Point"].max()})

0    False
1    False
2     True
3     True
Name: Point, dtype: bool

## 3.3 列ごとに昇順／降順を変えて確認するには

In [21]:
df = pd.DataFrame(
    [
        ["Alice", "国語", 87],
        ["Alice", "数学", np.nan],
        ["Bob", "国語", 65],
        ["Bob", "数学", 92],
    ],
    columns=["Name", "Subject", "Point"],
)
df

    Name Subject  Point
0  Alice      国語   87.0
1  Alice      数学    NaN
2    Bob      国語   65.0
3    Bob      数学   92.0

### やってみよう

In [24]:
df.sort_values(["Name","Point"],ascending=[False,True])

    Name Subject  Point
2    Bob      国語   65.0
3    Bob      数学   92.0
0  Alice      国語   87.0
1  Alice      数学    NaN